Q1. List any five functions of the pandas library with execution.

Solution : 
    
    describe() , applymap() , rolling() , merge() , join()

In [2]:
import pandas as pd

d1 = {"name" : ["Mohan","Sohan","Rakesh","Dinesh"] , 
      "Age" : [25,27,30,35] , 
      "Fare" : [100,80,110,120]
     }

df = pd.DataFrame(d1)

df

     name  Age  Fare
0   Mohan   25   100
1   Sohan   27    80
2  Rakesh   30   110
3  Dinesh   35   120

In [3]:
# describe()

df.describe()

             Age        Fare
count   4.000000    4.000000
mean   29.250000  102.500000
std     4.349329   17.078251
min    25.000000   80.000000
25%    26.500000   95.000000
50%    28.500000  105.000000
75%    31.250000  112.500000
max    35.000000  120.000000

In [5]:
# applymap()
df1 = df[["Age" , "Fare"]]
df1.applymap(lambda x : x**2)

    Age   Fare
0   625  10000
1   729   6400
2   900  12100
3  1225  14400

In [8]:
# rolling()
df["Age"].rolling(window = 2).sum()

0     NaN
1    52.0
2    57.0
3    65.0
Name: Age, dtype: float64

In [11]:
# merge()

d1 = {"key1" : [1,2,3,4] , "key2" : [3,4,5,6] }

d2 = {"key1" : [3,5,7,0] ,"key3" : [1,5,9,3]}

df1 = pd.DataFrame(d1)

df2 = pd.DataFrame(d2)

pd.merge(df1 , df2 , how = "left")

   key1  key2  key3
0     1     3   NaN
1     2     4   NaN
2     3     5   1.0
3     4     6   NaN

In [27]:
# join()

d1 = {"key1" : [1,2,3,4] , "key2" : [3,4,5,6] }

d2 = {"key4" : [3,5,7,0] ,"key3" : [1,5,9,3]}

df1 = pd.DataFrame(d1 , index = ["a","b","c","d"])

df2 = pd.DataFrame(d2 , index = ["a" , "j" , "l" , "o"])

In [28]:
df1

   key1  key2
a     1     3
b     2     4
c     3     5
d     4     6

In [29]:
df2

   key4  key3
a     3     1
j     5     5
l     7     9
o     0     3

In [30]:
df1.join(df2)

   key1  key2  key4  key3
a     1     3   3.0   1.0
b     2     4   NaN   NaN
c     3     5   NaN   NaN
d     4     6   NaN   NaN

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [31]:
d1 = {"A" : ["Mohan","Sohan","Rakesh","Dinesh"] , 
      "B" : [25,27,30,35] , 
      "C" : [100,80,110,120]
     }

df = pd.DataFrame(d1)

df

        A   B    C
0   Mohan  25  100
1   Sohan  27   80
2  Rakesh  30  110
3  Dinesh  35  120

In [33]:
df.reindex([1,3,5,7])

        A     B      C
1   Sohan  27.0   80.0
3  Dinesh  35.0  120.0
5     NaN   NaN    NaN
7     NaN   NaN    NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [34]:
df = pd.DataFrame({"Values" : [1,2,3,4,5,6,7,8,9]})

df

   Values
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [36]:
for i in df.iterrows():
    print(i)

(0, Values    1
Name: 0, dtype: int64)
(1, Values    2
Name: 1, dtype: int64)
(2, Values    3
Name: 2, dtype: int64)
(3, Values    4
Name: 3, dtype: int64)
(4, Values    5
Name: 4, dtype: int64)
(5, Values    6
Name: 5, dtype: int64)
(6, Values    7
Name: 6, dtype: int64)
(7, Values    8
Name: 7, dtype: int64)
(8, Values    9
Name: 8, dtype: int64)

In [38]:
df2 = df.rolling(window = 3).sum()

In [39]:
df2

   Values
0     NaN
1     NaN
2     6.0
3     9.0
4    12.0
5    15.0
6    18.0
7    21.0
8    24.0

In [41]:
df2.iloc[2]

Values    6.0
Name: 2, dtype: float64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [42]:
d1 = {"Text" : ["data science" , "I am learning python" , "hello this is me"]}

df = pd.DataFrame(d1)

In [47]:
df

                   Text
0          data science
1  I am learning python
2      hello this is me

In [48]:
df["Word_Count"] = df["Text"].apply(lambda x : len(x.split()))

In [49]:
df

                   Text  Word_Count
0          data science           2
1  I am learning python           4
2      hello this is me           4

Q5. How are DataFrame.size() and DataFrame.shape() different?

In [50]:
d1 = {"A" : ["Mohan","Sohan","Rakesh","Dinesh"] , 
      "B" : [25,27,30,35] , 
      "C" : [100,80,110,120]
     }

df = pd.DataFrame(d1)

df

        A   B    C
0   Mohan  25  100
1   Sohan  27   80
2  Rakesh  30  110
3  Dinesh  35  120

In [52]:
df.shape  # it tells the no. of rows, columns

(4, 3)

In [53]:
df.size # it tells the total number of elements

12

Q6. Which function of pandas do we use to read an excel file?

read_excel() is used to read an excel file

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [54]:
data = {"Email" : ["abc@domain.com" , "harry@domain.com" , "xyz@domain.com"]}

df = pd.DataFrame(data)

In [55]:
df

              Email
0    abc@domain.com
1  harry@domain.com
2    xyz@domain.com

In [56]:
df["Username"] = df["Email"].apply(lambda x : x.split("@")[0])

In [57]:
df

              Email Username
0    abc@domain.com      abc
1  harry@domain.com    harry
2    xyz@domain.com      xyz

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [58]:
data = {"A" : [3,8,6,2,9] , "B" : [5,2,9,3,1] , "C" : [1,7,4,5,2]}

df = pd.DataFrame(data)

In [59]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [63]:
df1 = df[df["A"] > 5]

In [64]:
df1

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [65]:
df2 = df[df["B"] < 10]

In [66]:
df2

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [67]:
pd.merge(df1,df2)

   A  B  C
0  8  2  7
1  6  9  4
2  9  1  2